#!/bin/bash
##########################################################
#概要 :PostBlogのshow.html.erbファイルの最終行に改行コードを挿入。
#      挿入後、コミット&プッシュを実行
##########################################################
#--------------------------------------------------------------
#変数宣言
#--------------------------------------------------------------
#ルートディレクトリ~PostBlogまでの絶対パスを記載
DIR="${HOME}/go/ATourOfGo/Basics/More types: structs, slices, and maps."

#--------------------------------------------------------------
#GitHubにコミット&プッシュ
#--------------------------------------------------------------
git add .
git commit --allow-empty-message -m ''
git push origin master
